# Prepare example dataset

In [1]:
! wget https://archive.ics.uci.edu/ml/machine-learning-databases/00222/bank.zip -O bank.zip
! unzip -o bank.zip -d datasets/bank

--2019-12-25 11:32:31--  https://archive.ics.uci.edu/ml/machine-learning-databases/00222/bank.zip
Resolving archive.ics.uci.edu (archive.ics.uci.edu)... 128.195.10.252
Connecting to archive.ics.uci.edu (archive.ics.uci.edu)|128.195.10.252|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 579043 (565K) [application/x-httpd-php]
Saving to: ‘bank.zip’

bank.zip            100%[===================>] 565.47K   616KB/s    in 0.9s

2019-12-25 11:32:32 (616 KB/s) - ‘bank.zip’ saved [579043/579043]

Archive:  bank.zip
  inflating: datasets/bank/bank-full.csv
  inflating: datasets/bank/bank-names.txt
  inflating: datasets/bank/bank.csv

In [2]:
file_path = "datasets/bank/bank-full.csv"

# Loading as different Dataframe

## Spark Dataframe

In [3]:
df = (spark.read
           .option("inferSchema", "true")
           .option("header", "true")
           .option("delimiter", ";")
           .option("quote", '"')
           .csv(file_path))

df.show(5)

+---+------------+-------+---------+-------+-------+-------+----+-------+---+-----+--------+--------+-----+--------+--------+---+
|age|         job|marital|education|default|balance|housing|loan|contact|day|month|duration|campaign|pdays|previous|poutcome|  y|
+---+------------+-------+---------+-------+-------+-------+----+-------+---+-----+--------+--------+-----+--------+--------+---+
| 58|  management|married| tertiary|     no|   2143|    yes|  no|unknown|  5|  may|     261|       1|   -1|       0| unknown| no|
| 44|  technician| single|secondary|     no|     29|    yes|  no|unknown|  5|  may|     151|       1|   -1|       0| unknown| no|
| 33|entrepreneur|married|secondary|     no|      2|    yes| yes|unknown|  5|  may|      76|       1|   -1|       0| unknown| no|
| 47| blue-collar|married|  unknown|     no|   1506|    yes|  no|unknown|  5|  may|      92|       1|   -1|       0| unknown| no|
| 33|     unknown| single|  unknown|     no|      1|     no|  no|unknown|  5|  may|     198|       1|   -1|       0| unknown| no|
+---+------------+-------+---------+-------+-------+-------+----+-------+---+-----+--------+--------+-----+--------+--------+---+
only showing top 5 rows

## Pandas Dataframe

In [4]:
import pandas as pd

pdf = pd.read_csv(file_path, header=0, sep=";", quotechar='"')
display(pdf.head())

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no

## Koalas Dataframe

In [5]:
import databricks.koalas as ks

kdf = ks.read_csv(file_path, header=0, sep=";", quotechar='"')
display(kdf.head())

   age           job  marital  education default  balance housing loan  contact  day month  duration  campaign  pdays  previous poutcome   y
0   58    management  married   tertiary      no     2143     yes   no  unknown    5   may       261         1     -1         0  unknown  no
1   44    technician   single  secondary      no       29     yes   no  unknown    5   may       151         1     -1         0  unknown  no
2   33  entrepreneur  married  secondary      no        2     yes  yes  unknown    5   may        76         1     -1         0  unknown  no
3   47   blue-collar  married    unknown      no     1506     yes   no  unknown    5   may        92         1     -1         0  unknown  no
4   33       unknown   single    unknown      no        1      no   no  unknown    5   may       198         1     -1         0  unknown  no

In [6]:
# Converting to Koalas Dataframe from Spark DataFrame

# Creating a Koalas DataFrame from PySpark DataFrame
# kdf = ks.DataFrame(df)

# # Alternative way of creating a Koalas DataFrame from PySpark DataFrame
# kdf = df.to_koalas()

# Koalas Dataframe -> PySpark DataFrame
# kdf.to_spark()

# Column Manipulation

In [7]:
# Creating a column with PySpark
from pyspark.sql.functions import col

df = df.withColumn("duration_new", col("duration") + 100)
df.show(5)

+---+------------+-------+---------+-------+-------+-------+----+-------+---+-----+--------+--------+-----+--------+--------+---+------------+
|age|         job|marital|education|default|balance|housing|loan|contact|day|month|duration|campaign|pdays|previous|poutcome|  y|duration_new|
+---+------------+-------+---------+-------+-------+-------+----+-------+---+-----+--------+--------+-----+--------+--------+---+------------+
| 58|  management|married| tertiary|     no|   2143|    yes|  no|unknown|  5|  may|     261|       1|   -1|       0| unknown| no|         361|
| 44|  technician| single|secondary|     no|     29|    yes|  no|unknown|  5|  may|     151|       1|   -1|       0| unknown| no|         251|
| 33|entrepreneur|married|secondary|     no|      2|    yes| yes|unknown|  5|  may|      76|       1|   -1|       0| unknown| no|         176|
| 47| blue-collar|married|  unknown|     no|   1506|    yes|  no|unknown|  5|  may|      92|       1|   -1|       0| unknown| no|         192|
| 33|     unknown| single|  unknown|     no|      1|     no|  no|unknown|  5|  may|     198|       1|   -1|       0| unknown| no|         298|
+---+------------+-------+---------+-------+-------+-------+----+-------+---+-----+--------+--------+-----+--------+--------+---+------------+
only showing top 5 rows

In [8]:
# Creating a column with Pandas
pdf["duration_new"] = pdf["duration"] + 100
display(pdf.head())

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y,duration_new
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no,361
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no,251
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no,176
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no,192
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no,298

In [9]:
# Creating a column with Koalas
kdf["duration_new"] = kdf["duration"] + 100
display(kdf.head())

   age           job  marital  education default  balance housing loan  contact  day month  duration  campaign  pdays  previous poutcome   y  duration_new
0   58    management  married   tertiary      no     2143     yes   no  unknown    5   may       261         1     -1         0  unknown  no           361
1   44    technician   single  secondary      no       29     yes   no  unknown    5   may       151         1     -1         0  unknown  no           251
2   33  entrepreneur  married  secondary      no        2     yes  yes  unknown    5   may        76         1     -1         0  unknown  no           176
3   47   blue-collar  married    unknown      no     1506     yes   no  unknown    5   may        92         1     -1         0  unknown  no           192
4   33       unknown   single    unknown      no        1      no   no  unknown    5   may       198         1     -1         0  unknown  no           298

# Filtering

In [10]:
# Filtering with PySpark
df_filtered  = df.filter(col("duration_new") >= 300)
print(df_filtered.count())

20459

In [11]:
# Filtering with Pandas
pdf_filtered = pdf[pdf.duration_new >= 300]
print(pdf_filtered.shape[0])

20459

In [12]:
# Filtering with Koalas
kdf_filtered = kdf[kdf.duration_new >= 300]
print(kdf_filtered.shape[0])

20459

# Value Counts

In [13]:
# To get value counts of the different job types with PySpark
df.groupby("job") \
    .count() \
    .orderBy("count", ascending=False) \
    .show()

+-------------+-----+
|          job|count|
+-------------+-----+
|  blue-collar| 9732|
|   management| 9458|
|   technician| 7597|
|       admin.| 5171|
|     services| 4154|
|      retired| 2264|
|self-employed| 1579|
| entrepreneur| 1487|
|   unemployed| 1303|
|    housemaid| 1240|
|      student|  938|
|      unknown|  288|
+-------------+-----+

In [14]:
# Value counts in Koalas
pdf["job"].value_counts()

blue-collar      9732
management       9458
technician       7597
admin.           5171
services         4154
retired          2264
self-employed    1579
entrepreneur     1487
unemployed       1303
housemaid        1240
student           938
unknown           288
Name: job, dtype: int64

In [15]:
# Value counts in Koalas
kdf["job"].value_counts()

blue-collar      9732
management       9458
technician       7597
admin.           5171
services         4154
retired          2264
self-employed    1579
entrepreneur     1487
unemployed       1303
housemaid        1240
student           938
unknown           288
Name: job, dtype: int64

# GroupBy

In [16]:
# Get average age per education group using PySpark
df_grouped_1 = (df.groupby("education")
                .agg({"age": "mean"})
                .select("education", col("avg(age)").alias("avg_age")))

df_grouped_1.show()

+---------+------------------+
|education|           avg_age|
+---------+------------------+
|  unknown| 44.51050080775444|
| tertiary| 39.59363957597173|
|secondary|39.964270321524005|
|  primary| 45.86556707050066|
+---------+------------------+

In [17]:
# Get the average age per education group in Pandas
pdf_grouped_1 = pdf.groupby("education", as_index=False).agg({"age": "mean"})

# Rename our columns
pdf_grouped_1.columns = ["education", "avg_age"]
display(pdf_grouped_1)

   education    avg_age
0    primary  45.865567
1  secondary  39.964270
2   tertiary  39.593640
3    unknown  44.510501

In [18]:
# Get the average age per education group in Koalas
kdf_grouped_1 = kdf.groupby("education", as_index=False).agg({"age": "mean"})

# Rename our columns
kdf_grouped_1.columns = ["education", "avg_age"]
display(kdf_grouped_1)

   education    avg_age
0    unknown  44.510501
1   tertiary  39.593640
2  secondary  39.964270
3    primary  45.865567

# Writing Data

In [19]:
# Saving the Spark DataFrame as a Parquet file.
df_grouped_1.write.mode("overwrite").parquet("datasets/bank_grouped_pyspark.parquet")

In [20]:
# Saving the Pandas DataFrame as a Parquet file.
pdf_grouped_1.to_parquet("datasets/bank_grouped_pandas.parquet")

In [21]:
# Saving the Koalas DataFrame as a Parquet file.
kdf_grouped_1.to_parquet("datasets/bank_grouped_koalas.parquet", mode="overwrite")